# OnLinkEnd Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExportContext..::..OnLinkEnd Method
IExportContext Interface See Also
---
This method marks the end of a link instance being exported.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
void OnLinkEnd(
	LinkNode node
)
```

Visual Basic
---
```text
Sub OnLinkEnd ( _
	node As LinkNode _
)
```

Visual C++
---
```text
void OnLinkEnd(
	LinkNode^ node
)
```

# ### Parameters
node
    Type: Autodesk.Revit.DB..::..LinkNode An output node that represents a Revit link.
# See Also
IExportContext Interface
Autodesk.Revit.DB Namespace